Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: Generate route with L<Mojolicious::Routes::Route/"put">, matching only C<PUT> requests.
ja: Generate route with [[Mojolicious::Routes::Route/"put"]], matching only C<PUT> requests.

source: Generate route with L<Mojolicious::Routes::Route/"websocket">, matching only WebSocket handshakes.
ja: Generate route with [[Mojolicious::Routes::Route/"websocket"]], matching only WebSocket handshakes.

source: Generate stack trace and store all L</"frames">, defaults to skipping C<1> call frame.
ja: Generate stack trace and store all [[/"frames"]], defaults to skipping C<1> call frame.

source: Generating content with the L<Mojolicious> renderer.
ja: Generating content with the [[Mojolicious]] renderer.

source: Get CSRF token from L</"session">, and generate one if none exists.
ja: Get CSRF token from [[/"session"]], and generate one if none exists.

source: Get L<Mojo::IOLoop::Server> object for id or turn object into an acceptor.
ja: Get [[Mojo::IOLoop::Server]] object for id or turn object into an acceptor.

source: Get L<Mojo::IOLoop::Stream> object for id or turn object into a connection.
ja: Get [[Mojo::IOLoop::Stream]] object for id or turn object into a connection.

source: Get L<Mojo::Message::Request> object from L</"tx">.
ja: Get [[Mojo::Message::Request]] object from [[/"tx"]].

source: Get L<Mojo::Message::Response> object from L</"tx">.
ja: Get [[Mojo::Message::Response]] object from [[/"tx"]].

source: Get L<Mojolicious::Validator::Validation> object for current request to validate file uploads as well as C<GET> and C<POST> parameters extracted from the query string and C<application/x-www-form-urlencoded> or C<multipart/form-data> message body.
ja: Get [[Mojolicious::Validator::Validation]] object for current request to validate file uploads as well as C<GET> and C<POST> parameters extracted from the query string and C<application/x-www-form-urlencoded> or C<multipart/form-data> message body.

source: Get absolute L<Mojo::URL> object for server processing blocking requests with L</"app"> and switch protocol if necessary.
ja: Get absolute [[Mojo::URL]] object for server processing blocking requests with [[/"app"]] and switch protocol if necessary.

source: Get absolute L<Mojo::URL> object for server processing non-blocking requests with L</"app"> and switch protocol if necessary.
ja: Get absolute [[Mojo::URL]] object for server processing non-blocking requests with [[/"app"]] and switch protocol if necessary.

source: Get handle for server, usually an L<IO::Socket::IP> object.
ja: Get handle for server, usually an [[IO::Socket::IP]] object.

source: Get handle for stream, usually an L<IO::Socket::IP> or L<IO::Socket::SSL> object.
ja: Get handle for stream, usually an [[IO::Socket::IP]] or [[IO::Socket::SSL]] object.

source: Get or replace current header value, shortcut for the C<Access-Control-Allow-Origin> header from L<Cross-Origin Resource Sharing|http://www.w3.org/TR/cors/>.
ja: Get or replace current header value, shortcut for the C<Access-Control-Allow-Origin> header from [[Cross-Origin Resource Sharing|http://www.w3.org/TR/cors/]].

source: Get or replace current header value, shortcut for the C<Sec-WebSocket-Extensions> header from L<RFC 6455|http://tools.ietf.org/html/rfc6455>.
ja: Get or replace current header value, shortcut for the C<Sec-WebSocket-Extensions> header from [[RFC 6455|http://tools.ietf.org/html/rfc6455]].

source: Get or replace current header value, shortcut for the C<Strict-Transport-Security> header from L<RFC 6797|http://tools.ietf.org/html/rfc6797>.
ja: Get or replace current header value, shortcut for the C<Strict-Transport-Security> header from [[RFC 6797|http://tools.ietf.org/html/rfc6797]].

source: Get or replace current header value, shortcut for the C<Content-Security-Policy> header from L<Content Security Policy 1.0|http://www.w3.org/TR/CSP/>.
ja: Get or replace current header value, shortcut for the C<Content-Security-Policy> header from [[Content Security Policy 1.0|http://www.w3.org/TR/CSP/]].

source: Get or replace current header value, shortcut for the C<Cookie> header from L<RFC 6265|http://tools.ietf.org/html/rfc6265>.
ja: Get or replace current header value, shortcut for the C<Cookie> header from [[RFC 6265|http://tools.ietf.org/html/rfc6265]].

source: Get or replace current header value, shortcut for the C<Link> header from L<RFC 5988|http://tools.ietf.org/html/rfc5988>.
ja: Get or replace current header value, shortcut for the C<Link> header from [[RFC 5988|http://tools.ietf.org/html/rfc5988]].

source: Get or replace current header value, shortcut for the C<Origin> header from L<RFC 6454|http://tools.ietf.org/html/rfc6454>.
ja: Get or replace current header value, shortcut for the C<Origin> header from [[RFC 6454|http://tools.ietf.org/html/rfc6454]].

source: Get or replace current header value, shortcut for the C<Referer> header, there was a typo in L<RFC 2068|http://tools.ietf.org/html/rfc2068> which resulted in C<Referer> becoming an official header.
ja: Get or replace current header value, shortcut for the C<Referer> header, there was a typo in [[RFC 2068|http://tools.ietf.org/html/rfc2068]] which resulted in C<Referer> becoming an official header.

source: Get or replace current header value, shortcut for the C<Sec-WebSocket-Accept> header from L<RFC 6455|http://tools.ietf.org/html/rfc6455>.
ja: Get or replace current header value, shortcut for the C<Sec-WebSocket-Accept> header from [[RFC 6455|http://tools.ietf.org/html/rfc6455]].

source: Get or replace current header value, shortcut for the C<Sec-WebSocket-Key> header from L<RFC 6455|http://tools.ietf.org/html/rfc6455>.
ja: Get or replace current header value, shortcut for the C<Sec-WebSocket-Key> header from [[RFC 6455|http://tools.ietf.org/html/rfc6455]].

source: Get or replace current header value, shortcut for the C<Sec-WebSocket-Protocol> header from L<RFC 6455|http://tools.ietf.org/html/rfc6455>.
ja: Get or replace current header value, shortcut for the C<Sec-WebSocket-Protocol> header from [[RFC 6455|http://tools.ietf.org/html/rfc6455]].

source: Get or replace current header value, shortcut for the C<Sec-WebSocket-Version> header from L<RFC 6455|http://tools.ietf.org/html/rfc6455>.
ja: Get or replace current header value, shortcut for the C<Sec-WebSocket-Version> header from [[RFC 6455|http://tools.ietf.org/html/rfc6455]].

source: Get or replace current header value, shortcut for the C<Server-Timing> header from L<Server Timing|https://www.w3.org/TR/server-timing/>.
ja: Get or replace current header value, shortcut for the C<Server-Timing> header from [[Server Timing|https://www.w3.org/TR/server-timing/]].

source: Get or replace current header value, shortcut for the C<Set-Cookie> header from L<RFC 6265|http://tools.ietf.org/html/rfc6265>.
ja: Get or replace current header value, shortcut for the C<Set-Cookie> header from [[RFC 6265|http://tools.ietf.org/html/rfc6265]].

source: Get or replace current header value, shortcut for the C<Status> header from L<RFC 3875|http://tools.ietf.org/html/rfc3875>.
ja: Get or replace current header value, shortcut for the C<Status> header from [[RFC 3875|http://tools.ietf.org/html/rfc3875]].

source: Get or set C<title> stash value, all additional key/value pairs get merged into the L</"stash">.
ja: Get or set C<title> stash value, all additional key/value pairs get merged into the [[/"stash"]].

source: Get process id for running server from L</"pid_file"> or delete it if server is not running.
ja: Get process id for running server from [[/"pid_file"]] or delete it if server is not running.

source: Getting L<Mojolicious> and L<Mojolicious::Lite> applications running on different platforms.
ja: Getting [[Mojolicious]] and [[Mojolicious::Lite]] applications running on different platforms.

source: HTML or XML semantics can also be forced with the L</"xml"> method.
ja: HTML or XML semantics can also be forced with the [[/"xml"]] method.

source: HTTP request URL, defaults to a L<Mojo::URL> object.
ja: HTTP request URL, defaults to a [[Mojo::URL]] object.

source: HTTP request, defaults to a L<Mojo::Message::Request> object.
ja: HTTP request, defaults to a [[Mojo::Message::Request]] object.

source: HTTP response, defaults to a L<Mojo::Message::Response> object.
ja: HTTP response, defaults to a [[Mojo::Message::Response]] object.

source: Handshake request, usually a L<Mojo::Message::Request> object.
ja: Handshake request, usually a [[Mojo::Message::Request]] object.

source: Handshake response, usually a L<Mojo::Message::Response> object.
ja: Handshake response, usually a [[Mojo::Message::Response]] object.

source: Headers for upload, usually a L<Mojo::Headers> object.
ja: Headers for upload, usually a [[Mojo::Headers]] object.

source: Heartbeat interval in seconds, defaults to the value of L<Mojo::Server::Prefork/"heartbeat_interval">.
ja: Heartbeat interval in seconds, defaults to the value of [[Mojo::Server::Prefork/"heartbeat_interval"]].

source: Helpers are little functions you can create with the keyword L<Mojolicious::Lite/"helper"> and reuse throughout your whole application, from actions to templates.
ja: ヘルパーは [[Mojolicious::Lite]]のC<helper> キーワードで作ることができる小さな関数です。アクションからテンプレートまでアプリケーション全体において利用することができます。

source: Here are a few examples from the L<Test::Mojo> documentation:
ja: Here are a few examples from the [[Test::Mojo]] documentation:

source: Here we can see our application class name C<MyApp> is passed to the L<Test::Mojo> constructor.
ja: Here we can see our application class name C<MyApp> is passed to the [[Test::Mojo]] constructor.

source: Here's an example for how L<Mojo::UserAgent/"get_p"> works internally.
ja: Here's an example for how [[Mojo::UserAgent/"get_p"]] works internally.

source: High resolution time elapsed from an arbitrary fixed point in the past, resilient to time jumps if a monotonic clock is available through L<Time::HiRes>.
ja: High resolution time elapsed from an arbitrary fixed point in the past, resilient to time jumps if a monotonic clock is available through [[Time::HiRes]].

source: Hooks operate outside the routing system and allow you to extend the framework itself by sharing code with all requests indiscriminately through L<Mojolicious/"hook">, which makes them a very powerful tool especially for plugins.
ja: Hooks operate outside the routing system and allow you to extend the framework itself by sharing code with all requests indiscriminately through [[Mojolicious/"hook"]], which makes them a very powerful tool especially for plugins.

source: Host-only flag, indicating that the canonicalized request-host is identical to the cookie's L</"domain">.
ja: Host-only flag, indicating that the canonicalized request-host is identical to the cookie's [[/"domain"]].

source: However, now the client address is no longer available (which might be useful for analytics, or Geo-IP) and URLs generated via L<Mojolicious::Controller/"url_for"> will look like this:
ja: However, now the client address is no longer available (which might be useful for analytics, or Geo-IP) and URLs generated via [[Mojolicious::Controller/"url_for"]] will look like this:

source: However, to completely avoid any risk of accidental breakage, we do recommend following current best practices for version pinning with L<Carton> for production setups.
ja: However, to completely avoid any risk of accidental breakage, we do recommend following current best practices for version pinning with [[Carton]] for production setups.

source: If there are multiple uploads sharing the same name, and you want to access more than just the last one, you can use L</"every_upload">.
ja: If there are multiple uploads sharing the same name, and you want to access more than just the last one, you can use [[/"every_upload"]].

source: If there are multiple values sharing the same name, and you want to access more than just the last one, you can use L</"every_param">.
ja: If there are multiple values sharing the same name, and you want to access more than just the last one, you can use [[/"every_param"]].

source: If there are multiple values sharing the same name, and you want to access more than just the last one, you can use L</"every_signed_cookie">.
ja: If there are multiple values sharing the same name, and you want to access more than just the last one, you can use [[/"every_signed_cookie"]].

source: If every byte matters this is the smallest C<Hello World> application you can write with L<Mojolicious::Lite>.
ja: If every byte matters this is the smallest C<Hello World> application you can write with [[Mojolicious::Lite]].

source: If that's the case and you are certain that no MITM attack is being attempted, you can use the attribute L<Mojo::UserAgent/"insecure"> or C<MOJO_INSECURE> environment variable to disable certificate verification.
ja: If that's the case and you are certain that no MITM attack is being attempted, you can use the attribute [[Mojo::UserAgent/"insecure"]] or C<MOJO_INSECURE> environment variable to disable certificate verification.

source: If the configuration value C<config_override> has been set in L<Mojolicious/"config"> when this plugin is loaded, it will not do anything.
ja: If the configuration value C<config_override> has been set in [[Mojolicious/"config"]] when this plugin is loaded, it will not do anything.

source: If there are multiple values sharing the same name, and you want to access more than just the last one, you can use L</"every_cookie">.
ja: If there are multiple values sharing the same name, and you want to access more than just the last one, you can use [[/"every_cookie"]].

source: If there are multiple cookies sharing the same name, and you want to access more than just the last one, you can use L</"every_cookie">.
ja: If there are multiple cookies sharing the same name, and you want to access more than just the last one, you can use [[/"every_cookie"]].

source: If you are new to Perl, we recommend L<Learn Perl in 2 hours 30 minutes|http://qntm.org/files/perl/perl.html> for a quick introduction, or the L<Modern Perl book|https://pragprog.com/book/swperl/modern-perl-fourth-edition>, freely available in many formats.
ja: If you are new to Perl, we recommend [[Learn Perl in 2 hours 30 minutes|http://qntm.org/files/perl/perl.html]] for a quick introduction, or the [[Modern Perl book|https://pragprog.com/book/swperl/modern-perl-fourth-edition]], freely available in many formats.

source: If you believe someone is violating the code of conduct, we ask that you report it by emailing Joel Berger (C<jberger@mojolicious.org>) or other members of L<the team|Mojolicious/"CORE DEVELOPERS">.
ja: If you believe someone is violating the code of conduct, we ask that you report it by emailing Joel Berger (C<jberger@mojolicious.org>) or other members of [[the team|Mojolicious/"CORE DEVELOPERS"]].

source: If you have any questions the documentation might not yet answer, don't hesitate to ask on the L<mailing list|http://groups.google.com/group/mojolicious> or the official IRC channel C<#mojo> on C<irc.freenode.net> (L<chat now!|https://kiwiirc.com/nextclient/#irc://irc.freenode.net/mojo?nick=guest-?>).
ja: このドキュメントでわからない部分があれば、 [[mailing list|http://groups.google.com/group/mojolicious]] かC<irc.freenode.net> (L<chat now!|https://kiwiirc.com/nextclient/#irc://irc.freenode.net/mojo?nick=guest-?>)の公式IRCチャンネル C<#mojo> まで気軽に質問してください。

source: If you pass the name of a L<Mojolicious> application class (e.g., 'MyApp') to the L<Test::Mojo> constructor, L<Test::Mojo> will instantiate the class and start it, and cause it to listen on a random (unused) port number.
ja: If you pass the name of a [[Mojolicious]] application class (e.g., 'MyApp') to the [[Test::Mojo]] constructor, [[Test::Mojo]] will instantiate the class and start it, and cause it to listen on a random (unused) port number.

source: If you run a business and use L<Mojolicious> in a revenue generating product, it makes business sense to support L<Mojolicious> development.
ja: If you run a business and use [[Mojolicious]] in a revenue generating product, it makes business sense to support [[Mojolicious]] development.

source: If you want to compress all dynamically generated content you can also activate L<Mojolicious::Renderer/"compress">.
ja: If you want to compress all dynamically generated content you can also activate [[Mojolicious::Renderer/"compress"]].

source: If you're not sure in advance if a template actually exists, you can also use the method L<Mojolicious::Controller/"render_maybe"> to try multiple alternatives.
ja: If you're not sure in advance if a template actually exists, you can also use the method [[Mojolicious::Controller/"render_maybe"]] to try multiple alternatives.

source: In L<Mojolicious> applications you can also use the helper L<Mojolicious::Plugin::DefaultHelpers/"inactivity_timeout"> to change it on demand for each connection individually.
ja: In [[Mojolicious]] applications you can also use the helper [[Mojolicious::Plugin::DefaultHelpers/"inactivity_timeout"]] to change it on demand for each connection individually.

source: In L<Mojolicious> however we are taking this concept one step further by storing everything JSON serialized and Base64 encoded in HMAC-SHA1 signed cookies, which is more compatible with the REST philosophy and reduces infrastructure requirements.
ja: In [[Mojolicious]] however we are taking this concept one step further by storing everything JSON serialized and Base64 encoded in HMAC-SHA1 signed cookies, which is more compatible with the REST philosophy and reduces infrastructure requirements.

source: In L<Mojolicious> this event loop is L<Mojo::IOLoop>.
ja: In [[Mojolicious]] this event loop is [[Mojo::IOLoop]].

source: In L<Mojolicious> we consider web applications simple frontends for existing business logic, that means L<Mojolicious> is by design entirely I<model> layer agnostic and you just use whatever Perl modules you like most.
ja: In [[Mojolicious]] we consider web applications simple frontends for existing business logic, that means [[Mojolicious]] is by design entirely I<model]] layer agnostic and you just use whatever Perl modules you like most.

source: In L<Mojolicious> we take testing very serious and try to make it a pleasant experience.
ja: In [[Mojolicious]] we take testing very serious and try to make it a pleasant experience.

source: In addition to a class name or L<Mojo::File> object pointing to the application script, you can pass along a hash reference with configuration values that will be used to override the application configuration.
ja: In addition to a class name or [[Mojo::File]] object pointing to the application script, you can pass along a hash reference with configuration values that will be used to override the application configuration.

source: In addition to the L</"ATTRIBUTES"> and L</"METHODS"> above you can also call helpers on L<Mojolicious> objects.
ja: In addition to the [[/"ATTRIBUTES"]] and [[/"METHODS"]] above you can also call helpers on [[Mojolicious]] objects.

source: In addition to the L</"ATTRIBUTES"> and L</"METHODS"> above you can also call helpers provided by L</"app"> on L<Mojolicious::Controller> objects.
ja: In addition to the [[/"ATTRIBUTES"]] and [[/"METHODS"]] above you can also call helpers provided by [[/"app"]] on [[Mojolicious::Controller]] objects.

source: In addition to the L</"ATTRIBUTES"> and L</"METHODS"> above you can also call shortcuts provided by L</"root"> on L<Mojolicious::Routes::Route> objects.
ja: In addition to the [[/"ATTRIBUTES"]] and [[/"METHODS"]] above you can also call shortcuts provided by [[/"root"]] on [[Mojolicious::Routes::Route]] objects.

source: In addition to the L</"ATTRIBUTES"> and L</"METHODS"> above, you can also call validation checks provided by L</"validator"> on L<Mojolicious::Validator::Validation> objects, similar to L</"check">.
ja: In addition to the [[/"ATTRIBUTES"]] and [[/"METHODS"]] above, you can also call validation checks provided by [[/"validator"]] on [[Mojolicious::Validator::Validation]] objects, similar to [[/"check"]].

source: In conformance with L<Mojolicious::Guides::Contributing>, we will always deprecate a feature for 3 months, before removing or changing it in incompatible ways between major releases.
ja: In conformance with [[Mojolicious::Guides::Contributing]], we will always deprecate a feature for 3 months, before removing or changing it in incompatible ways between major releases.

source: In controllers you can also use the method L<Mojolicious::Controller/"helpers"> to fully qualify helper calls and ensure that they don't conflict with existing methods you may already have.
ja: In controllers you can also use the method [[Mojolicious::Controller/"helpers"]] to fully qualify helper calls and ensure that they don't conflict with existing methods you may already have.

source: In such cases you can use the hook L<Mojolicious/"before_dispatch"> to rewrite incoming requests.
ja: In such cases you can use the hook [[Mojolicious/"before_dispatch"]] to rewrite incoming requests.

source: In the C<send_ok> assertion we take advantage of L<Mojo::UserAgent>'s JSON content generator (see L<Mojo::UserAgent::Transactor>) to marshal hash and array references into JSON documents, and then send them as a WebSocket message.
ja: In the C<send_ok> assertion we take advantage of [[Mojo::UserAgent]]'s JSON content generator (see [[Mojo::UserAgent::Transactor]]) to marshal hash and array references into JSON documents, and then send them as a WebSocket message.

source: In the example below, the call to L</"begin"> creates a code reference that we can pass to L<Mojo::IOLoop/"timer"> as a callback, and that leads to the next closure in the series when executed.
ja: In the example below, the call to [[/"begin"]] creates a code reference that we can pass to [[Mojo::IOLoop/"timer"]] as a callback, and that leads to the next closure in the series when executed.

source: In the rest of this document we'll explore these concepts and others related to L<Test::Mojo>.
ja: In the rest of this document we'll explore these concepts and others related to [[Test::Mojo]].

source: In this section we've covered how to add custom test assertions to L<Test::Mojo> with roles and how to use those roles to simplify testing.
ja: In this section we've covered how to add custom test assertions to [[Test::Mojo]] with roles and how to use those roles to simplify testing.

source: Inheritance takes the layout concept above one step further, the helpers L<Mojolicious::Plugin::DefaultHelpers/"content"> and L<Mojolicious::Plugin::DefaultHelpers/"extends"> allow you to build skeleton templates with named blocks that child templates can override.
ja: Inheritance takes the layout concept above one step further, the helpers [[Mojolicious::Plugin::DefaultHelpers/"content"]] and [[Mojolicious::Plugin::DefaultHelpers/"extends"]] allow you to build skeleton templates with named blocks that child templates can override.

source: Inspect L</"message">, L</"frames"> and optional additional sources to fill L</"lines_before">, L</"line"> and L</"lines_after"> with context information.
ja: Inspect [[/"message"]], [[/"frames"]] and optional additional sources to fill [[/"lines_before"]], [[/"line"]] and [[/"lines_after"]] with context information.

source: Instead of providing a C<Content-Length> header you can also call L<Mojolicious::Controller/"finish"> and close the connection manually once you are done.
ja: Instead of providing a C<Content-Length> header you can also call [[Mojolicious::Controller/"finish"]] and close the connection manually once you are done.
